/*
﻿بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ
اَللهُ لآ اِلَهَ اِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَاْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي اْلاَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ اِلاَّ بِاِذْنِهِ يَعْلَمُ مَا بَيْنَ اَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ اِلاَّ بِمَا شَآءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَاْلاَرْضَ وَلاَ يَؤُدُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ (255) 

بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ
وَوَصَّيْنَ الْإِنسَانَ بِوَالِدَيْهِ 
حُسْنً وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ حُسْناً وَإِن 
جَاهَدَاكَ لِتُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا إِلَيَّ 
مَرْجِعُكُمْ فَأُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُون
*/
#include <iostream>
#include <fstream>
#define baya while
#define don for
#define KONT(xx) (xx >= BAS && xx <= SON && xx > j && !(D[xx]==YER))
#define ec int
using namespace std;
int SON,BAS,T;
int D[2000005];
ifstream al("C-large.in");
ofstream bas("C-large.out");
inline int cevirr(int ab,int carp){return (ab*10)%carp+(ab*10)/carp;}
void oku()
{
	int i,j,xx,say=0,x,t,YER=0;
	al >> T;
	don(i=1;i<=T;i++){
		al >> BAS >> SON;
		don(j=BAS;j<=SON;j++){
			t=1;
			YER++;
			xx=x=j;
			baya(x){t*=10;x/=10;}
			x=j;
			baya(x)
			{
				xx=cevirr(xx,t);
				if(KONT(xx))
				{
					say++;
					D[xx]=YER;
				}
				x/=10;
			}
		}
		bas << "Case #" << i << ": " << say << endl;
		say=0;
	}
}
ec main()
{
	oku();
	return 0;
}
